In [1]:
import numpy as np

In [2]:
a=np.array([1,2,3,4,5],dtype='float')
a

array([1., 2., 3., 4., 5.])

In [3]:
arr=np.array((1,2,3,4,5)) #tuple
arr

array([1, 2, 3, 4, 5])

## pandas 
------- stands for pannel data
- it is a important module in data science libraries
- data analysis,data manipulation,removal of unwanted data
- data structures
      -series 
      - dataframes
- with it we can do the data analysis,manupulation,cleaning
##### data analysation
   - statistics of the data
   - volume of the data
#### data manipulation   
       - changing data from one form to another
       - merging and concatination,join
#### data cleaning
      - deleting unwanted data 
      - deleting null values and Nan values...etc! 
 
 
 
 - we can create the pandas series with list,tuple,dictionary,string

In [4]:
 import pandas as pd

In [5]:
   pd.__version__

'1.2.4'

In [6]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [7]:
a=pd.Series("i am from vrsec")
a

0    i am from vrsec
dtype: object

In [8]:
print("enter the string:")
b=input()
c= pd.Series(b)
print(c)

enter the string:
abc cvb
0    abc cvb
dtype: object

In [9]:
b=input()
c= pd.Series(b.split(" "))
print(c)

i am from vrsec
0        i
1       am
2     from
3    vrsec
dtype: object

In [10]:
t=(1,2,3,4)
t1=pd.Series(t)
t1

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
l1=[1,2,3,4]
l2=pd.Series(l1)
l2

0    1
1    2
2    3
3    4
dtype: int64

In [12]:
d=pd.Series(range(20,26))
d

0    20
1    21
2    22
3    23
4    24
5    25
dtype: int64

In [13]:
dic={"list":[1,2,3],"tuple":(3,4,5),"string":"hello","int":10}
dic

{'list': [1, 2, 3], 'tuple': (3, 4, 5), 'string': 'hello', 'int': 10}

In [14]:
dict1=pd.Series(dic)
dict1

list      [1, 2, 3]
tuple     (3, 4, 5)
string        hello
int              10
dtype: object

In [15]:
dict1.index

Index(['list', 'tuple', 'string', 'int'], dtype='object')

In [16]:
import numpy as np
arr=np.arange (10,50,5)
arr1=pd.Series(arr)
arr1

0    10
1    15
2    20
3    25
4    30
5    35
6    40
7    45
dtype: int32

In [17]:
arr[0]

10

In [18]:
len(arr1)

8

In [19]:
arr1[len(arr1)-1] # get the last value of array

45

In [20]:
arr1[0:2]

0    10
1    15
dtype: int32

In [21]:
arr1.index

RangeIndex(start=0, stop=8, step=1)

In [22]:
arr1.index=[23,34,46,56,14,57,23,45]
arr1

23    10
34    15
46    20
56    25
14    30
57    35
23    40
45    45
dtype: int32

In [23]:
li=["hi","hello","good","hope"]
pd.Series(li)

0       hi
1    hello
2     good
3     hope
dtype: object

In [24]:
li=["hi","hello","good","hope"]
pd.Series(li,index=(1,2,3,4))

1       hi
2    hello
3     good
4     hope
dtype: object

In [25]:
li=["hi","hello","good","hope"]
ind=[i for i in range(15,19)]
pd.Series(li,index=ind)

15       hi
16    hello
17     good
18     hope
dtype: object

In [26]:
dic

{'list': [1, 2, 3], 'tuple': (3, 4, 5), 'string': 'hello', 'int': 10}

In [27]:
dict2=pd.Series(dic,index=ind)
dict2

15    NaN
16    NaN
17    NaN
18    NaN
dtype: object

In [28]:
dict2.index

Int64Index([15, 16, 17, 18], dtype='int64')


### DataFrames

In [29]:
df1=pd.DataFrame(dic)

In [30]:
data={56:"fiftysix","float":10.23,"prgm":"workshop","name":"da"}
data

{56: 'fiftysix', 'float': 10.23, 'prgm': 'workshop', 'name': 'da'}

In [31]:
df2=pd.DataFrame(data,index="i am in vrsec".split(" "))

In [32]:
pd.concat([df1,df2])

       list  tuple string   int        56  float      prgm name
0       1.0    3.0  hello  10.0       NaN    NaN       NaN  NaN
1       2.0    4.0  hello  10.0       NaN    NaN       NaN  NaN
2       3.0    5.0  hello  10.0       NaN    NaN       NaN  NaN
i       NaN    NaN    NaN   NaN  fiftysix  10.23  workshop   da
am      NaN    NaN    NaN   NaN  fiftysix  10.23  workshop   da
in      NaN    NaN    NaN   NaN  fiftysix  10.23  workshop   da
vrsec   NaN    NaN    NaN   NaN  fiftysix  10.23  workshop   da

In [33]:
dict3={"first":[1,2,3,4],"second":[5,6,7,8],"third":(45,56,67,78)}
dict3

{'first': [1, 2, 3, 4], 'second': [5, 6, 7, 8], 'third': (45, 56, 67, 78)}

In [34]:
df3=pd.DataFrame(dict3,index=[2001,2002,2003,2004])
df3

      first  second  third
2001      1       5     45
2002      2       6     56
2003      3       7     67
2004      4       8     78

In [35]:
df4=pd.DataFrame({"fourth":[10,20,30,40],"fifth":[50,60,70,80],"sixth":(5,6,7,8)},
                index=[2005,2002,2003,2006])
df4

      fourth  fifth  sixth
2005      10     50      5
2002      20     60      6
2003      30     70      7
2006      40     80      8

In [36]:
df3.join(df4)

      first  second  third  fourth  fifth  sixth
2001      1       5     45     NaN    NaN    NaN
2002      2       6     56    20.0   60.0    6.0
2003      3       7     67    30.0   70.0    7.0
2004      4       8     78     NaN    NaN    NaN

In [37]:
df4.join(df3)

      fourth  fifth  sixth  first  second  third
2005      10     50      5    NaN     NaN    NaN
2002      20     60      6    2.0     6.0   56.0
2003      30     70      7    3.0     7.0   67.0
2006      40     80      8    NaN     NaN    NaN

In [38]:
df5=pd.DataFrame({"a":[8,5,9,6],"b":(4,19,82,37),"c":[9,27,61,15]})
df5

   a   b   c
0  8   4   9
1  5  19  27
2  9  82  61
3  6  37  15

In [39]:
df6=pd.DataFrame({"a":[8,2,9,6,1],"b":(4,1,8,3,5),"c":[9,7,1,5,8]})
df6

   a  b  c
0  8  4  9
1  2  1  7
2  9  8  1
3  6  3  5
4  1  5  8

In [41]:
new=df5.merge(df6)
new

   a  b  c
0  8  4  9

In [43]:
new.columns=["ab","bc","ca"]
new

   ab  bc  ca
0   8   4   9

In [53]:
new.index=([1])
new

   ab  bc  ca
1   8   4   9

In [68]:
dt=pd.date_range('20220101',"20220202")
dt

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15', '2022-01-16',
               '2022-01-17', '2022-01-18', '2022-01-19', '2022-01-20',
               '2022-01-21', '2022-01-22', '2022-01-23', '2022-01-24',
               '2022-01-25', '2022-01-26', '2022-01-27', '2022-01-28',
               '2022-01-29', '2022-01-30', '2022-01-31', '2022-02-01',
               '2022-02-02'],
              dtype='datetime64[ns]', freq='D')

In [74]:
dt=pd.date_range('2022-01-01',periods=6)
dt

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [75]:
pd.Series(dt)

0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
4   2022-01-05
5   2022-01-06
dtype: datetime64[ns]

In [76]:
temp=[12,45,7,8,5,4]
dt1=pd.Series(temp,index=dt)
dt1

2022-01-01    12
2022-01-02    45
2022-01-03     7
2022-01-04     8
2022-01-05     5
2022-01-06     4
Freq: D, dtype: int64

In [77]:
dt1["2022-01-06"]

4

### working with .csv files
  - reading .csv file with "read_csv()" method
  - syntax:- pd.read_csv("file location")

In [81]:
# read data
data=pd.read_csv("marks.csv")
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [96]:
# sample methad
data.sample(2)

  Roll Name  Maths  Discrete  OS    CO    DS
5   B2    J     63        45  67  56.0  50.0
2   A1    G     60        70  30   NaN  90.0

In [97]:
# head-returns the rows on the top
data.head()

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0
3   A2    H     40        60  73  50.0   NaN
4   B1    I     50        70  90  90.0   NaN

In [98]:
data.head(3)

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0

In [99]:
# tail
data.tail()

   Roll Name  Maths  Discrete  OS    CO    DS
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [100]:
data.tail(2)

   Roll Name  Maths  Discrete  OS    CO    DS
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [101]:
# accessing single column data
data["Roll"]

0     A1
1     A2
2     A1
3     A2
4     B1
5     B2
6     C1
7     C2
8     D1
9     D2
10    E1
11    E2
Name: Roll, dtype: object

In [106]:
data[["Roll","Name","Maths"]]

   Roll Name  Maths
0    A1    X     60
1    A2    Y     90
2    A1    G     60
3    A2    H     40
4    B1    I     50
5    B2    J     63
6    C1    K     67
7    C2    L     91
8    D1    M     40
9    D2    N      5
10   E1    X     50
11   E2    Y     60

In [109]:
# read the data which is needed
new=pd.read_csv("marks.csv",usecols=["Name",'Maths'])
new

   Name  Maths
0     X     60
1     Y     90
2     G     60
3     H     40
4     I     50
5     J     63
6     K     67
7     L     91
8     M     40
9     N      5
10    X     50
11    Y     60

In [110]:
data.columns

Index(['Roll', 'Name', 'Maths', 'Discrete', 'OS', 'CO', 'DS'], dtype='object')

In [111]:
data.index

RangeIndex(start=0, stop=12, step=1)

In [113]:
data.dtypes

Roll         object
Name         object
Maths         int64
Discrete      int64
OS            int64
CO          float64
DS          float64
dtype: object

In [115]:
data.info #textual information about data

<bound method DataFrame.info of    Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0>

In [116]:
data.describe()

           Maths   Discrete         OS         CO         DS
count  12.000000  12.000000  12.000000  10.000000   9.000000
mean   56.333333  60.583333  56.333333  68.900000  65.555556
std    22.928083  11.851032  21.465970  13.042239  23.511227
min     5.000000  45.000000  30.000000  50.000000  40.000000
25%    47.500000  45.000000  30.000000  59.500000  50.000000
50%    60.000000  68.500000  66.000000  72.500000  50.000000
75%    64.000000  70.000000  68.500000  74.500000  90.000000
max    91.000000  70.000000  90.000000  90.000000  90.000000

In [122]:
data.Maths.value_counts() # to get the frequency of the particular column

60    3
50    2
40    2
67    1
5     1
90    1
91    1
63    1
Name: Maths, dtype: int64

In [124]:
data["Maths"].value_counts()

60    3
50    2
40    2
67    1
5     1
90    1
91    1
63    1
Name: Maths, dtype: int64

In [125]:
data.shape

(12, 7)

In [126]:
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [128]:
data.sort_values("Name")

   Roll Name  Maths  Discrete  OS    CO    DS
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
0    A1    X     60        70  30  70.0  90.0
10   E1    X     50        70  30  80.0  90.0
1    A2    Y     90        45  67  73.0  50.0
11   E2    Y     60        45  77  73.0  40.0

In [131]:
data.sort_values("Name",ascending=False)

   Roll Name  Maths  Discrete  OS    CO    DS
1    A2    Y     90        45  67  73.0  50.0
11   E2    Y     60        45  77  73.0  40.0
0    A1    X     60        70  30  70.0  90.0
10   E1    X     50        70  30  80.0  90.0
9    D2    N      5        67  65  50.0   NaN
8    D1    M     40        70  50   NaN  90.0
7    C2    L     91        45  67  72.0  50.0
6    C1    K     67        70  30  75.0  40.0
5    B2    J     63        45  67  56.0  50.0
4    B1    I     50        70  90  90.0   NaN
3    A2    H     40        60  73  50.0   NaN
2    A1    G     60        70  30   NaN  90.0

In [136]:
data["total"]=100
data

   Roll Name  Maths  Discrete  OS    CO    DS  total
0    A1    X     60        70  30  70.0  90.0    100
1    A2    Y     90        45  67  73.0  50.0    100
2    A1    G     60        70  30   NaN  90.0    100
3    A2    H     40        60  73  50.0   NaN    100
4    B1    I     50        70  90  90.0   NaN    100
5    B2    J     63        45  67  56.0  50.0    100
6    C1    K     67        70  30  75.0  40.0    100
7    C2    L     91        45  67  72.0  50.0    100
8    D1    M     40        70  50   NaN  90.0    100
9    D2    N      5        67  65  50.0   NaN    100
10   E1    X     50        70  30  80.0  90.0    100
11   E2    Y     60        45  77  73.0  40.0    100

In [137]:
data.CO.sum()

689.0

In [138]:
data.isnull()

     Roll   Name  Maths  Discrete     OS     CO     DS  total
0   False  False  False     False  False  False  False  False
1   False  False  False     False  False  False  False  False
2   False  False  False     False  False   True  False  False
3   False  False  False     False  False  False   True  False
4   False  False  False     False  False  False   True  False
5   False  False  False     False  False  False  False  False
6   False  False  False     False  False  False  False  False
7   False  False  False     False  False  False  False  False
8   False  False  False     False  False   True  False  False
9   False  False  False     False  False  False   True  False
10  False  False  False     False  False  False  False  False
11  False  False  False     False  False  False  False  False

In [139]:
data.isna()

     Roll   Name  Maths  Discrete     OS     CO     DS  total
0   False  False  False     False  False  False  False  False
1   False  False  False     False  False  False  False  False
2   False  False  False     False  False   True  False  False
3   False  False  False     False  False  False   True  False
4   False  False  False     False  False  False   True  False
5   False  False  False     False  False  False  False  False
6   False  False  False     False  False  False  False  False
7   False  False  False     False  False  False  False  False
8   False  False  False     False  False   True  False  False
9   False  False  False     False  False  False   True  False
10  False  False  False     False  False  False  False  False
11  False  False  False     False  False  False  False  False

In [143]:
data.isnull().sum()

Roll        0
Name        0
Maths       0
Discrete    0
OS          0
CO          2
DS          3
total       0
dtype: int64

In [145]:
data.nunique()

Roll        10
Name        10
Maths        8
Discrete     4
OS           7
CO           8
DS           3
total        1
dtype: int64

In [147]:
clean=data.dropna()
clean

   Roll Name  Maths  Discrete  OS    CO    DS  total
0    A1    X     60        70  30  70.0  90.0    100
1    A2    Y     90        45  67  73.0  50.0    100
5    B2    J     63        45  67  56.0  50.0    100
6    C1    K     67        70  30  75.0  40.0    100
7    C2    L     91        45  67  72.0  50.0    100
10   E1    X     50        70  30  80.0  90.0    100
11   E2    Y     60        45  77  73.0  40.0    100